#ifndef UE4SS_SDK_IGLE_Pawn_Example_HPP
#define UE4SS_SDK_IGLE_Pawn_Example_HPP

class AIGLE_Pawn_Example_C : public AIGLE_Pawn_EditorBase_C
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0618 (size: 0x8)
    class USceneCaptureComponent2D* ScreenshotCapture;                                // 0x0620 (size: 0x8)
    class USceneCaptureComponent2D* AutoPlacableIconCapture;                          // 0x0628 (size: 0x8)
    float FocusOnSelectionTimeline_Alpha_EBB687394ACF11E86C17E39ABF246CFB;            // 0x0630 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> FocusOnSelectionTimeline__Direction_EBB687394ACF11E86C17E39ABF246CFB; // 0x0634 (size: 0x1)
    class UTimelineComponent* FocusOnSelectionTimeline;                               // 0x0638 (size: 0x8)
    class UIGLE_W_EditorHUD_C* EditorHUD;                                             // 0x0640 (size: 0x8)
    double MaxSelectionDistance;                                                      // 0x0648 (size: 0x8)
    bool LMBDown;                                                                     // 0x0650 (size: 0x1)
    FVector2D PreviousCursorLocation;                                                 // 0x0658 (size: 0x10)
    double BoxSelectionMinMouseSpeed;                                                 // 0x0668 (size: 0x8)
    TMap<class TSubclassOf<AActor>, class UTexture*> AutoGeneratedPlacableIcons;      // 0x0670 (size: 0x50)

    void TakeScreenshot(FString levelPath);
    void LoadFromCustomDataObject(class UIGLE_CustomDataObjectBase_C* CustomDataObject);
    void SaveToCustomDataObject(class UIGLE_CustomDataObjectBase_C* CustomDataObject);
    void FocusOnSelectionPrepare(FTransform& InitialTransform, FVector& SelectionMedian, double& SelectionRadius);
    void FocusOnSelectionTick(FVector SelectionLocation, double SelectionRadius, double Alpha, FTransform InitialTransform);
    void AddActionToActionLog(FString Text, FLinearColor Color);
    void Get Icon For Placable Actor(class AActor* PlacableActor, class UTexture*& IconTexture);
    void AutoFillIconsForPlacables(TArray<class AActor*>& TempActors, TMap<class TSubclassOf<AActor>, class UTexture*>& ActorClassToIconMap);
    void UserConstructionScript();
    void FocusOnSelectionTimeline__FinishedFunc();
    void FocusOnSelectionTimeline__UpdateFunc();
    void InpActEvt_RightMouseButton_K2Node_InputKeyEvent_17(FKey Key);
    void InpActEvt_RightMouseButton_K2Node_InputKeyEvent_16(FKey Key);
    void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_15(FKey Key);
    void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_14(FKey Key);
    void InpActEvt_Z_K2Node_InputKeyEvent_13(FKey Key);
    void InpActEvt_Y_K2Node_InputKeyEvent_12(FKey Key);
    void InpActEvt_Delete_K2Node_InputKeyEvent_11(FKey Key);
    void OnPlacablesRegistered_B78208AF40678E095EA060AB6CF32AA0(const TArray<class AActor*>& TempActors);
    void InpActEvt_W_K2Node_InputKeyEvent_10(FKey Key);
    void InpActEvt_E_K2Node_InputKeyEvent_9(FKey Key);
    void InpActEvt_R_K2Node_InputKeyEvent_8(FKey Key);
    void InpActEvt_Ctrl_S_K2Node_InputKeyEvent_7(FKey Key);
    void InpActEvt_Escape_K2Node_InputKeyEvent_6(FKey Key);
    void InpActEvt_P_K2Node_InputKeyEvent_5(FKey Key);
    void InpActEvt_F_K2Node_InputKeyEvent_4(FKey Key);
    void InpActEvt_LeftShift_K2Node_InputKeyEvent_3(FKey Key);
    void InpActEvt_LeftShift_K2Node_InputKeyEvent_2(FKey Key);
    void InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_1(FKey Key);
    void InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0(FKey Key);
    void InpAxisEvt_LookUp_K2Node_InputAxisEvent_3(float AxisValue);
    void ReceiveBeginPlay();
    void ReceiveTick(float DeltaSeconds);
    void LMB_Selection(bool LMB Down?);
    void LMB_UseGizmo(bool LMB Down);
    void TIck_BoxSelectionInput();
    void Event_OnViewportResize();
    void OpenPauseMenu();
    void FocusOnSelection();
    void InpAxisEvt_Turn_K2Node_InputAxisEvent_5(float AxisValue);
    void InpAxisEvt_MoveUp_K2Node_InputAxisEvent_7(float AxisValue);
    void InpAxisEvt_MoveRight_K2Node_InputAxisEvent_8(float AxisValue);
    void InpAxisEvt_MoveForward_K2Node_InputAxisEvent_9(float AxisValue);
    void ExecuteUbergraph_IGLE_Pawn_Example(int32 EntryPoint);
}; // Size: 0x6C0

#endif
